app/Controllers/Home.php

SELECT `productos`.*, `categorias`.`nombre_categoria`
FROM `productos`
JOIN `categorias` ON `categorias`.`id_cate` = `productos`.`id_categoria`
---
    public function index()
    {
        $productoModel = new Productos_model();

        $productos = $productoModel
            ->select('productos.*, categorias.nombre_categoria')
            ->join('categorias', 'categorias.id_cate = productos.id_categoria')
            ->findAll();