app/Controllers/Usuarios_controller.php

SELECT `usuarios`.*, `perfiles`.`descripcion` as `perfil`
FROM `usuarios`
JOIN `perfiles` ON `perfiles`.`id_perfiles` = `usuarios`.`id_perfil`
---
    public function lista_usuarios()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('usuarios');
        $builder->select('usuarios.*, perfiles.descripcion as perfil');
        $builder->join('perfiles', 'perfiles.id_perfiles = usuarios.id_perfil');
        $query = $builder->get();